app/controllers/home_controller.rb

SELECT "posts".* FROM "posts"   ORDER BY updated_at DESC
---
	def index
		@posts = Post.order('updated_at DESC')