app/controllers/posts_controller.rb

	def create
		params[:post].merge!(user_id: current_user.id)
		puts params[:post]
		@post = Post.new(params[:post].permit(:title, :content, :user_id))
		if @post.save
---
INSERT INTO "posts" ("content", "created_at", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Bobo!"], ["created_at", "2014-08-25 03:15:18.754392"], ["title", "Hello, again"], ["updated_at", "2014-08-25 03:15:18.754392"], ["user_id", 2]]

	def update
		@post = Post.find(params[:id])
		@post.update(params[:post].permit(:title, :content))
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = 6  [["content", "There once was a bobolink named Bobo who lived at DBC..."], ["updated_at", "2014-08-25 02:53:03.444040"]]

	def destroy
		Post.find(params[:id]).destroy
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 3]]
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 3]]