app/controllers/users_controller.rb

	def show
		@user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]

	def create
		@user = User.new(params[:user].permit(:first_name, :last_name, :email, :password, :password_confirmation))
		if @user.save
---
INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

	def login
		@user = User.find_by_email(params[:user][:email])
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'bobo@bobo.com' LIMIT 1

	def update
		@user = User.find(session[:user_id])
		puts params[:user]
		if @user.update_attributes(params[:user].permit(:first_name, :last_name, :email, :password, :password_confirmation))
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "users" SET "first_name" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = 2  [["first_name", "Bobo"], ["password_digest", "$2a$10$hek2oGZH6c1swB2LF8ifKehe.5WO.4vsgH6nVJsSj7QmBNLsohFWK"], ["updated_at", "2014-08-25 02:56:13.151532"]]